In [3]:
import cx_Oracle
import pandas as pd
con=cx_Oracle.connect('feb22_mounicka/feb22_mounicka@orcl-aws.c8sefhobaih4.ap-south-1.rds.amazonaws.com:1521/ORCL')
cur=con.cursor()
print(con.version)

12.1.0.2.0

## customer table

In [4]:
cust=pd.read_sql('select *from cust', con=con)
cust

   CUST_ID CUST_NAME   CUST_ADDRESS  CUST_CITY   PHONE_NO        CUST_EMAIL
0     1101       abc      ring road  bangalore  9656892.0     abc@gmail.com
1     1102       xyz      south end     mysore  9656892.0   xyz@yahoo.co.in
2     1103       pqr  ashoka pillar     hassan  9656892.0     pqr@gmail.com
3     1104       lmn    nandanavana     tumkur  9656892.0     lmn@gmail.com
4     1105       mno         tnagar      hubli  9656892.0   mno@yahoo.co.in
5     1106       tim        rrnagar  bangalore  9632192.0  tim123@gmail.com
6     1107       sam        jpnagar    chennai        NaN              None

In [9]:
#display cust sam detail
cust[cust['CUST_NAME']=='sam']

   CUST_ID CUST_NAME CUST_ADDRESS CUST_CITY  PHONE_NO CUST_EMAIL
6     1107       sam      jpnagar   chennai       NaN       None

In [10]:
#display all customer name start with a
cust['CUST_NAME'][cust['CUST_NAME'].str.startswith('a')]

0    abc
Name: CUST_NAME, dtype: object

In [11]:
#display customer who belong in bangalore
cust['CUST_NAME'][cust['CUST_CITY'].str.startswith('bangalore')]

0    abc
5    tim
Name: CUST_NAME, dtype: object

In [27]:
#display cust_id,name,city of cust tim
cust[['CUST_ID','CUST_NAME','CUST_CITY']][cust['CUST_NAME']=='tim']

   CUST_ID CUST_NAME  CUST_CITY
5     1106       tim  bangalore

## Product_retail table

In [34]:
pr=pd.read_sql('select*from product_retail',con=con)
pr

   PROD_ID    P_NAME  PRICE   COST LAUNCH_DATE     P_FAMILY
0      100        tv  40000  45000  2021-01-12  electronics
1      200    fridge  20000  18000  2022-02-24  electronics
2      300  Computer  30000  25000  2020-03-11  electronics
3      400   Printer  10000   8000  2020-08-16  electronics
4      500     table  25000  20000  2019-09-14    Furniture
5      600      sofa  80000  95000  2020-12-10    Furniture

In [88]:
#display prod_id where price is 40000 and p_name is tv
pr['PROD_ID'][(pr['PRICE']==40000) & (pr['P_NAME']=='tv')]

0    100
Name: PROD_ID, dtype: int64

In [48]:
#display product_name where price is in range of 30000 and 50000
pr['P_NAME'][pr['PRICE'].between(30000,50000)]

0          tv
2    Computer
Name: P_NAME, dtype: object

In [123]:
#display p_family wise average price
product=pr.groupby('P_FAMILY')
product['PRICE'].mean()

P_FAMILY
Furniture      52500.0
electronics    25000.0
Name: PRICE, dtype: float64

In [149]:
#display product name,profit,price,cost
pr.assign(profit=pr['PRICE']-pr['COST'])[['P_NAME','COST','PRICE','profit']]

     P_NAME   COST  PRICE  profit
0        tv  45000  40000   -5000
1    fridge  18000  20000    2000
2  Computer  25000  30000    5000
3   Printer   8000  10000    2000
4     table  20000  25000    5000
5      sofa  95000  80000  -15000

In [153]:
#display product profit more than 1000
pr.assign(profit=pr['PRICE']-pr['COST']>1000)[['P_NAME','profit']]

     P_NAME  profit
0        tv   False
1    fridge    True
2  Computer    True
3   Printer    True
4     table    True
5      sofa   False

In [171]:
#disply product which is not in p_family electronics,furniture
family=('electronics','Furniture')
pr[~pr.P_FAMILY.isin(family)]

Empty DataFrame
Columns: [PROD_ID, P_NAME, PRICE, COST, LAUNCH_DATE, P_FAMILY]
Index: []

In [172]:
#disply product which is in p_family electronics,furniture
pr[pr.P_FAMILY.isin(family)]

   PROD_ID    P_NAME  PRICE   COST LAUNCH_DATE     P_FAMILY
0      100        tv  40000  45000  2021-01-12  electronics
1      200    fridge  20000  18000  2022-02-24  electronics
2      300  Computer  30000  25000  2020-03-11  electronics
3      400   Printer  10000   8000  2020-08-16  electronics
4      500     table  25000  20000  2019-09-14    Furniture
5      600      sofa  80000  95000  2020-12-10    Furniture

## Resort table

In [124]:
res=pd.read_sql('select*from resort',con=con)
res

   RES_ID    RES_NAME      RES_TYPE  COUNTRY_ID
0      50  TAJ MUMBAI   CITY CENTER         100
1      51     TAJ GOA  BEACH RESORT         100
2      52      RAMADA  BEACH RESORT         101
3      53   BLUE LIFE  BEACH RESORT         101
4      54  LEMON TREE   CITY CENTER         100

In [125]:
#display the count of resort
res.groupby(['COUNTRY_ID']).count()

            RES_ID  RES_NAME  RES_TYPE
COUNTRY_ID
100              3         3         3
101              2         2         2

In [154]:
#display the count of resort
res.groupby('COUNTRY_ID')['RES_ID'].count()

COUNTRY_ID
100    3
101    2
Name: RES_ID, dtype: int64

## customer2 table

In [69]:
ctt=pd.read_sql('select*from customer2',con=con)
ctt

   CUST_ID CUST_NAME  CUST_PHONE CUST_CITY   CUST_DOB  COUNTRY_ID
0        1       TIM  67687898.0        NY 2000-01-10         102
1        2      BILL  89978997.0        NY 1999-02-12         102
2        3       RAM  87997997.0       BLR 2001-03-13         100
3        4     KUMAR  56867989.0       BLR 2003-04-19         100
4        5       UMA  54578999.0   TORANTO        NaT         103
5        6     SURAJ  97909788.0   TORANTO 1998-11-15         103
6        7      SUMA         NaN    MUMBAI        NaT         100
7        8      VISH         NaN    MUMBAI 1988-02-14         100

In [141]:
#display countrywise number of cust 
ctt.groupby('COUNTRY_ID')['CUST_ID'].count()

COUNTRY_ID
100    4
102    2
103    2
Name: CUST_ID, dtype: int64

In [135]:
#display cust who doesn't have phone
ctt['CUST_NAME'][ctt['CUST_PHONE'].isna()]

6    SUMA
7    VISH
Name: CUST_NAME, dtype: object

In [136]:
#display cust who have phone
ctt['CUST_NAME'][ctt['CUST_PHONE'].notna()]

0      TIM
1     BILL
2      RAM
3    KUMAR
4      UMA
5    SURAJ
Name: CUST_NAME, dtype: object

## Sales_retail table

In [95]:
sales=pd.read_sql('select*from sales_retail',con=con)
sales

    SALES_ID SALES_DATE  CUST_ID  PROD_ID  AMOUNT
0          1 2020-04-22     1101      100   25000
1          2 2021-12-13     1102      100   35000
2          3 2020-03-29     1103      200   65000
3          4 2019-06-19     1104      200   85000
4          5 2018-11-20     1105      300   95000
5          6 2021-05-20     1105      300   25000
6          7 2020-05-21     1101      300   45000
7          8 2020-05-22     1101      300   55000
8          9 2021-05-23     1101      400   45000
9         10 2020-05-24     1102      100   15000
10        11 2019-05-20     1102      200   25000
11        12 2018-05-21     1103      400   45000
12        13 2019-05-22     1104      500   55000
13        14 2020-05-23     1105      200   45000
14        15 2020-05-24     1105      100   15000

In [138]:
#display customer which made highest sale
sales.groupby('CUST_ID')['AMOUNT'].sum().max()

180000

In [120]:
#display custmoer who has highest amount
sales['AMOUNT'].max()

95000